Конфигурация/DataProcessors/ИмпортРасчетныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортРасчетныхЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортироватьТолькоОтсутствующиеКотировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеЦеныНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеЦеныНРД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PRICE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_LBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_UBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VERSION</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>METHOD_NUMBER</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TYPE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКодовВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКодовВТорговыхСистемах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSBoard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодВДепозитарии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CFI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБКраткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSStandart</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ИмпортРасчетныхЦен/Ext/ObjectModule.bsl
Процедура ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналс() Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналс";
	Сессия = ЗаполнитьПараметрыДляСбораСтатистикиИЗарегистрироватьНовуюСессию(Механизм);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	БлокировкаНРД = Новый БлокировкаДанных;
	ЭлементБлокировкиНРД = БлокировкаНРД.Добавить("РегистрСведений.РасчетныеЦеныНРД");
	Если НачалоДня(ЭтотОбъект.Период.ДатаНачала) = НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("Период", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	ЭлементБлокировкиНРД.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаНРД.Заблокировать();
	
	// Инициализация вспомогательных переменных
	СтрокаСоединения	= РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапроса		= "
		|SELECT
		|	CONVERT (DateTime, Prices.est_date, 126) [ДатаПроведенияОценки],
		|	Prices.isin,
		|	Prices.price,
		|	Prices.rate,
		|	Prices.type
		|FROM
		|	Externals.dbo.NSD_Prices_OldVersion [Prices]
		|WHERE
		|	CONVERT (DateTime, Prices.est_date, 126) BETWEEN &ДатаНачала AND &ДатаОкончания";
	
	ДатаНачалаSQL		= "'" + Формат(ЭтотОбъект.Период.ДатаНачала,    "ДФ=yyyyMMdd") + "'";
	ДатаОкончанияSQL	= "'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'";
	
	// Подготавливаем запрос
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНачала", ДатаНачалаSQL);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаОкончания", ДатаОкончанияSQL);
	
	// Получаем котировки с сервера
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("ДатаПроведенияОценки",	Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("ISIN",					Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	ТипыКолонок.Вставить("PRICE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.PRICE.Тип);
	ТипыКолонок.Вставить("RATE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.RATE.Тип);
	ТипыКолонок.Вставить("TYPE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Реквизиты.TYPE.Тип);
	
	Попытка
		КотировкиНРД = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	Исключение
	КонецПопытки;
	
	Если КотировкиНРД = Неопределено Тогда
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для загрузки котировок НРД (старый формат)");
		Иначе
			ЗарегистрироватьОшибку("Нет данных для загрузки котировок НРД (старый формат)");
		КонецЕсли;
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.ДатаПроведенияОценки КАК ДатаПроведенияОценки,
		|	ТаблицаДанных.ISIN КАК ISIN,
		|	ТаблицаДанных.PRICE КАК PRICE,
		|	ТаблицаДанных.RATE КАК RATE,
		|	ТаблицаДанных.TYPE КАК TYPE
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДанных.ISIN КАК ISIN,
		|	_ТаблицаДанных.ДатаПроведенияОценки КАК ДатаПроведенияОценки,
		|	МАКСИМУМ(КодыISIN.Период) КАК ДатаИзменения
		|ПОМЕСТИТЬ _ДатыИзмененияКодаISIN
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
		|		ПО (КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|			И (КодыISIN.Код = _ТаблицаДанных.ISIN)
		|			И (КодыISIN.Период <= _ТаблицаДанных.ДатаПроведенияОценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаДанных.ISIN,
		|	_ТаблицаДанных.ДатаПроведенияОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыISIN.Объект КАК ЦеннаяБумага,
		|	ТИПЗНАЧЕНИЯ(КодыISIN.Объект) КАК ТипЦБ,
		|	_ТаблицаДанных.ДатаПроведенияОценки КАК Период,
		|	_ТаблицаДанных.ISIN КАК ISIN,
		|	_ТаблицаДанных.PRICE КАК PRICE,
		|	_ТаблицаДанных.RATE КАК RATE,
		|	_ТаблицаДанных.TYPE КАК TYPE
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыИзмененияКодаISIN КАК _ДатыИзмененияКодаISIN
		|		ПО (_ДатыИзмененияКодаISIN.ISIN = _ТаблицаДанных.ISIN)
		|			И (_ДатыИзмененияКодаISIN.ДатаПроведенияОценки = _ТаблицаДанных.ДатаПроведенияОценки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
		|		ПО (КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|			И (КодыISIN.Код = _ТаблицаДанных.ISIN)
		|			И (КодыISIN.Период = _ДатыИзмененияКодаISIN.ДатаИзменения)
		|			И (1 = 1)
		|ИТОГИ ПО
		|	ТипЦБ";
		
	Запрос.УстановитьПараметр("ТаблицаДанных", КотировкиНРД);
	
	// Отбор по ЦБ
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "КодыISIN.Объект = &ЦеннаяБумага");
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	ВыборкаПоТипуЦБ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаПоТипуЦБ.Следующий() Цикл
		Рынок = Неопределено;
		
		Выборка = ВыборкаПоТипуЦБ.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			
			// Определяем рынок
			Если Рынок = Неопределено Тогда
				Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Выборка.ЦеннаяБумага);	
			КонецЕсли;			
			Если Не ЗначениеЗаполнено(Рынок) Тогда
				ЗарегистрироватьОшибку("Не удалось определить рынок ценной бумаги " + Строка(Выборка.ЦеннаяБумага));
				ОтменитьТранзакцию();
				Прервать;
			КонецЕсли;
			
			// Записываем
			Запись = РегистрыСведений.РасчетныеЦеныНРД.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Рынок = Рынок;
			
			Если ЭтотОбъект.ИмпортироватьТолькоОтсутствующиеКотировки Тогда
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Рынок = Рынок;
			КонецЕсли;
			
			Попытка
				Запись.Записать();
			Исключение
				ЗарегистрироватьОшибку(ОписаниеОшибки());	
				ОтменитьТранзакцию();
				Прервать;
			КонецПопытки;
			
		КонецЦикла;	
	КонецЦикла;
	
	// Оповещаем пользователя
	ОповеститьОбОшибках(Механизм);

	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Котировки НРД успешно загружены.");
	КонецЕсли;	
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРД() Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРД";
	Сессия = ЗаполнитьПараметрыДляСбораСтатистикиИЗарегистрироватьНовуюСессию(Механизм);

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);

	БлокировкаНРД        = Новый БлокировкаДанных;
	ЭлементБлокировкиНРД = БлокировкаНРД.Добавить("РегистрСведений.РасчетныеЦеныНРД");
	
	Если НачалоДня(ЭтотОбъект.Период.ДатаНачала) = НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("Период", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	ЭлементБлокировкиНРД.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаНРД.Заблокировать();
	
	// так как на выходных непонятно прогрузились ли данные, в понедельник прогрузим 2 дня
	Если ДеньНедели(ЭтотОбъект.Период.ДатаНачала) = 7 Тогда
		ДатаЗагрузки = КонецДня(ЭтотОбъект.Период.ДатаНачала) - 172800;
	Иначе	
		ДатаЗагрузки = КонецДня(ЭтотОбъект.Период.ДатаНачала);
	КонецЕсли;
	
	Пока ДатаЗагрузки <= ЭтотОбъект.Период.ДатаОкончания Цикл
		
		МассивФорматовДаты = Новый Массив;
		МассивФорматовДаты.Добавить(Формат(ДатаЗагрузки, "ДФ=ddMMyyyy"));
		МассивФорматовДаты.Добавить(Формат(ДатаЗагрузки, "ДФ=yyyyMMdd"));
		
		// Ищем подходящий по формату имени файл
		ИмяФайлаXML = "";
		Для Каждого ФорматДаты Из МассивФорматовДаты Цикл
			
			ТекФайл = Новый Файл("\\g1\shares\1Cv8\AM\DataExchange\NSD_Prices\val_all_" + ФорматДаты + ".xml");
			
			Если ТекФайл.Существует() Тогда
		    	ИмяФайлаXML = ТекФайл.ПолноеИмя;
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;
		
		ДатаЗагрузки = ДатаЗагрузки + 86400;
		
		Если ПустаяСтрока(ИмяФайлаXML) Тогда
			Продолжить;
		КонецЕсли; 
				
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(ИмяФайлаXML);
		Исключение
			Продолжить;
		КонецПопытки;
		
		ПостроительDOM = Новый ПостроительDOM;
		
		ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
		
		ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath("//estimation/estimation_date", ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
		
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		ДатаПроведенияОценки = ЭлементDOM.ТекстовоеСодержимое;
		
		ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath("//estimation/market", ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("isin",  Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
		ТаблицаДанных.Колонки.Добавить("price", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		ТаблицаДанных.Колонки.Добавить("rate",  Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦенаПроцент.Тип);
		
		Пока Истина Цикл
			
			ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
			Если ЭлементDOM = Неопределено Тогда
				Прервать
			КонецЕсли;
			
			Для каждого УзелИнструмент Из ЭлементDOM.ДочерниеУзлы Цикл
				
				Колонки = Новый Структура;
				Отказ = Ложь;
				Для каждого РеквизитИнструмента Из УзелИнструмент.ДочерниеУзлы Цикл
					
					Если ТаблицаДанных.Колонки.Найти(РеквизитИнструмента.ИмяУзла) = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					
					Если РеквизитИнструмента.ИмяУзла = "type" и РеквизитИнструмента.ТекстовоеСодержимое = "otc" Тогда
						Отказ = Истина;
						Прервать;
					КонецЕсли;
					
					Колонки.Вставить(РеквизитИнструмента.ИмяУзла, РеквизитИнструмента.ТекстовоеСодержимое);
				
				КонецЦикла; 
				
				Если Не Отказ Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), Колонки);
				КонецЕсли; 
			
			КонецЦикла; 
			
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
		
		ПериодДт = Дата(СтрЗаменить(ДатаПроведенияОценки, "-", ""));
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДанных.isin,
			|	ТаблицаДанных.price,
			|	ТаблицаДанных.rate
			|ПОМЕСТИТЬ _ТаблицаДанных
			|ИЗ
			|	&ТаблицаДанных КАК ТаблицаДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Период,
			|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
			|	_ТаблицаДанных.price,
			|	_ТаблицаДанных.rate
			|ИЗ
			|	_ТаблицаДанных КАК _ТаблицаДанных
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
			|		ПО _ТаблицаДанных.isin = КодыВТорговыхСистемахСрезПоследних.Код
			|			И 1 = 1";
					   
		Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
		Запрос.УстановитьПараметр("Период", ПериодДт);
		
		// Отбор по ЦБ
		Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "КодыВТорговыхСистемахСрезПоследних.Объект = &ЦеннаяБумага");
			Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Выборка.ЦеннаяБумага);			
			Если Не ЗначениеЗаполнено(Рынок) Тогда
				ЗарегистрироватьОшибку("Не удалось определить рынок ценной бумаги " + Строка(Выборка.ЦеннаяБумага));
				ОтменитьТранзакцию();
				Прервать;
			КонецЕсли;
			
			Запись = РегистрыСведений.РасчетныеЦеныНРД.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Рынок = Рынок;
			
			Если ЭтотОбъект.ИмпортироватьТолькоОтсутствующиеКотировки Тогда
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Рынок = Рынок;
			КонецЕсли;
			
			Попытка
				Запись.Записать();
			Исключение
				ЗарегистрироватьОшибку(ОписаниеОшибки());	
				ОтменитьТранзакцию();
				Прервать;
			КонецПопытки;
		
		КонецЦикла; 
		
	КонецЦикла;
	
	ОповеститьОбОшибках(Механизм);

	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД() Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД";
	Сессия = ЗаполнитьПараметрыДляСбораСтатистикиИЗарегистрироватьНовуюСессию(Механизм);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	БлокировкаНРД = Новый БлокировкаДанных;
	ЭлементБлокировкиНРД = БлокировкаНРД.Добавить("РегистрСведений.РасчетныеЦеныНРД");
	Если НачалоДня(ЭтотОбъект.Период.ДатаНачала) = НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("Период", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		ЭлементБлокировкиНРД.УстановитьЗначение("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	ЭлементБлокировкиНРД.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаНРД.Заблокировать();
	
	// Инициализация вспомогательных переменных
	СтрокаСоединения	= РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапроса		= "
		|SELECT
		|	CONVERT (DateTime, Prices.est_date, 104) [ДатаПроведенияОценки],
		|	Prices.isin,
		|	Prices.price,
		|	Prices.rate,
		|	Prices.rate_lbound,
		|	Prices.rate_ubound,
		|	Prices.version,
		|	Prices.method_number,
		|	Prices.type
		|FROM
		|	Externals.dbo.NSD_Prices_NewVersion [Prices]
		|WHERE
		|	CONVERT (DateTime, Prices.est_date, 104) BETWEEN &ДатаНачала AND &ДатаОкончания";
	
	ДатаНачалаSQL		= "'" + Формат(ЭтотОбъект.Период.ДатаНачала,    "ДФ=yyyyMMdd") + "'";
	ДатаОкончанияSQL	= "'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'";
	
	// Подготавливаем запрос
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНачала", ДатаНачалаSQL);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаОкончания", ДатаОкончанияSQL);
	
	// Получаем котировки с сервера
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("ДатаПроведенияОценки",	Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("ISIN",					Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	ТипыКолонок.Вставить("PRICE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.PRICE.Тип);
	ТипыКолонок.Вставить("RATE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.RATE.Тип);
	ТипыКолонок.Вставить("RATE_LBOUND",				Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.RATE_LBOUND.Тип);
	ТипыКолонок.Вставить("RATE_UBOUND",				Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Ресурсы.RATE_UBOUND.Тип);
	ТипыКолонок.Вставить("VERSION",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Реквизиты.VERSION.Тип);
	ТипыКолонок.Вставить("METHOD_NUMBER",			Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Реквизиты.METHOD_NUMBER.Тип);
	ТипыКолонок.Вставить("TYPE",					Метаданные.РегистрыСведений.РасчетныеЦеныНРД.Реквизиты.TYPE.Тип);
	
	Попытка
		КотировкиНРД = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	Исключение
	КонецПопытки;
	
	Если КотировкиНРД = Неопределено Тогда
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для загрузки котировок НРД (формат с 01.01.2018 г.)");
		Иначе
			ЗарегистрироватьОшибку("Нет данных для загрузки котировок НРД (формат с 01.01.2018 г.)");
		КонецЕсли;
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.ДатаПроведенияОценки КАК ДатаПроведенияОценки,
		|	ТаблицаДанных.ISIN КАК ISIN,
		|	ТаблицаДанных.PRICE КАК PRICE,
		|	ТаблицаДанных.RATE КАК RATE,
		|	ТаблицаДанных.RATE_LBOUND КАК RATE_LBOUND,
		|	ТаблицаДанных.RATE_UBOUND КАК RATE_UBOUND,
		|	ТаблицаДанных.VERSION КАК VERSION,
		|	ТаблицаДанных.METHOD_NUMBER КАК METHOD_NUMBER,
		|	ТаблицаДанных.TYPE КАК TYPE
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДанных.ISIN КАК ISIN,
		|	_ТаблицаДанных.ДатаПроведенияОценки КАК ДатаПроведенияОценки,
		|	МАКСИМУМ(КодыISIN.Период) КАК ДатаИзменения
		|ПОМЕСТИТЬ _ДатыИзмененияКодаISIN
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
		|		ПО (КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|			И (КодыISIN.Код = _ТаблицаДанных.ISIN)
		|			И (КодыISIN.Период <= _ТаблицаДанных.ДатаПроведенияОценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаДанных.ISIN,
		|	_ТаблицаДанных.ДатаПроведенияОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыISIN.Объект КАК ЦеннаяБумага,
		|	ТИПЗНАЧЕНИЯ(КодыISIN.Объект) КАК ТипЦБ,
		|	_ТаблицаДанных.ДатаПроведенияОценки КАК Период,
		|	_ТаблицаДанных.ISIN КАК ISIN,
		|	_ТаблицаДанных.PRICE КАК PRICE,
		|	_ТаблицаДанных.RATE КАК RATE,
		|	_ТаблицаДанных.RATE_LBOUND КАК RATE_LBOUND,
		|	_ТаблицаДанных.RATE_UBOUND КАК RATE_UBOUND,
		|	_ТаблицаДанных.VERSION КАК VERSION,
		|	_ТаблицаДанных.METHOD_NUMBER КАК METHOD_NUMBER,
		|	_ТаблицаДанных.TYPE КАК TYPE
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыИзмененияКодаISIN КАК _ДатыИзмененияКодаISIN
		|		ПО (_ДатыИзмененияКодаISIN.ISIN = _ТаблицаДанных.ISIN)
		|			И (_ДатыИзмененияКодаISIN.ДатаПроведенияОценки = _ТаблицаДанных.ДатаПроведенияОценки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
		|		ПО (КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|			И (КодыISIN.Код = _ТаблицаДанных.ISIN)
		|			И (КодыISIN.Период = _ДатыИзмененияКодаISIN.ДатаИзменения)
		|			И (1 = 1)
		|ИТОГИ ПО
		|	ТипЦБ";
		
	Запрос.УстановитьПараметр("ТаблицаДанных", КотировкиНРД);
	
	// Отбор по ЦБ
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "КодыISIN.Объект = &ЦеннаяБумага");
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	ВыборкаПоТипуЦБ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаПоТипуЦБ.Следующий() Цикл
		Рынок = Неопределено;
		
		Выборка = ВыборкаПоТипуЦБ.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			
			// Определяем рынок
			Если Рынок = Неопределено Тогда
				Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Выборка.ЦеннаяБумага);	
			КонецЕсли;			
			Если Не ЗначениеЗаполнено(Рынок) Тогда
				ЗарегистрироватьОшибку("Не удалось определить рынок ценной бумаги " + Строка(Выборка.ЦеннаяБумага));
				ОтменитьТранзакцию();
				Прервать;
			КонецЕсли;
			
			// Записываем
			Запись = РегистрыСведений.РасчетныеЦеныНРД.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Рынок = Рынок;
			
			Если ЭтотОбъект.ИмпортироватьТолькоОтсутствующиеКотировки Тогда
				// Аццки долго, но это делалось лишь один раз с 01.01.18 по 14.01.18
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Рынок = Рынок;
			КонецЕсли;
			
			Попытка
				Запись.Записать();
			Исключение
				ЗарегистрироватьОшибку(ОписаниеОшибки());	
				ОтменитьТранзакцию();
				Прервать;
			КонецПопытки;
			
		КонецЦикла;	
	КонецЦикла;
	
	// Оповещаем пользователя
	ОповеститьОбОшибках(Механизм);

	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Котировки НРД успешно загружены.");
	КонецЕсли;	
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ЗагрузитьРасчетныеЦеныRUData() Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗагрузитьРасчетныеЦеныRUData";
	Сессия = ЗаполнитьПараметрыДляСбораСтатистикиИЗарегистрироватьНовуюСессию(Механизм);
	
	// Подготавливаем запрос
	
	СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрихExternal(); // база Матрих_Ехтегпа1
	
	ТекстЗапроса =
		"SELECT
		|	CAST(Prices.date AS DateTime) [ДатаПроведенияОценки],
		|	CAST(Prices.ExchangeTree_ID AS VARCHAR(20)) AS [ИдентификаторИсточника],
		|	Prices.isin,
		|	Prices.ask,
		|	Prices.bid,
		|	Prices.last,
		|	Prices.currency AS [ИдентификаторВалюты]
		|FROM
		|	[MatriX_External].[RUDATA].[AM_Quotes] [Prices]
		|WHERE
		|	Prices.date BETWEEN &ДатаНачала AND &ДатаОкончания";
	
	ДатаНачалаSQL		= "'" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=yyyyMMdd") + "'";
	ДатаОкончанияSQL	= "'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНачала", ДатаНачалаSQL);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаОкончания", ДатаОкончанияSQL);
	
	// Получаем котировки с сервера
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("ДатаПроведенияОценки",	Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("ИдентификаторИсточника",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТипыКолонок.Вставить("ISIN",					Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	ТипыКолонок.Вставить("ASK",						Метаданные.РегистрыСведений.РасчетныеЦеныRUData.Ресурсы.ASK.Тип);
	ТипыКолонок.Вставить("BID",						Метаданные.РегистрыСведений.РасчетныеЦеныRUData.Ресурсы.BID.Тип);
	ТипыКолонок.Вставить("LAST",					Метаданные.РегистрыСведений.РасчетныеЦеныRUData.Ресурсы.LAST.Тип);
	ТипыКолонок.Вставить("ИдентификаторВалюты",		Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(128, ДопустимаяДлина.Переменная)));
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимБезУведомлений", Истина); // см. РаботаСВнешнимиСистемами.ОбработатьОшибку
	
	ЦеныRUData = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок, , ЭтотОбъект.ДополнительныеСвойства);
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		
		// Сообщения об ошибках генерируются в РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера,
		// обработаем их и выйдем из функции без регистрации окончания сессии статистики
		
		ОповеститьОбОшибках(Механизм);
		Возврат;
		
	ИначеЕсли ЦеныRUData = Неопределено Тогда
		
		// Запрос отработал нормально, но данных нет.
		// В рабочий или торговый день должны быть данные, если их нет - это ошибка
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		
			Если Справочники.Календари.КоличествоРабочихДней(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания) > 0
				ИЛИ Справочники.Календари.КоличествоРабочихДней(Константы.ОсновнойКалендарьКотировок.Получить(), ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания) > 0
		    Тогда
			
			    ТекстОшибки = СтрШаблон("Нет данных для загрузки цен RU Data за %1. Т.к. период включает рабочие/торговые дни, то необходимо проверить корректность их отсутствия.",
					ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания));
			
				ЗарегистрироватьОшибку(СтрЗаменить(ТекстОшибки, "..", "."));	
						
			КонецЕсли;
					
		КонецЕсли;
		
	Иначе	
		
		// Запрос вернул данные
		
		#Область Загрузка_данных_в_1С
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДанных.ДатаПроведенияОценки,		
			|	ТаблицаДанных.ИдентификаторИсточника,
			|	ТаблицаДанных.ISIN,
			|	ТаблицаДанных.ASK,
			|	ТаблицаДанных.BID,
			|	ТаблицаДанных.LAST,
			|	ТаблицаДанных.ИдентификаторВалюты
			|ПОМЕСТИТЬ _ТаблицаДанных
			|ИЗ
			|	&ТаблицаДанных КАК ТаблицаДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДанных.ISIN КАК ISIN,
			|	_ТаблицаДанных.ДатаПроведенияОценки КАК ДатаПроведенияОценки,
			|	МАКСИМУМ(КодыISIN.Период) КАК ДатаИзменения
			|ПОМЕСТИТЬ _ДатыИзмененияКодаISIN
			|ИЗ
			|	_ТаблицаДанных КАК _ТаблицаДанных	
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
			|	ПО КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
			|		И КодыISIN.Код = _ТаблицаДанных.ISIN
			|		И КодыISIN.Период <= _ТаблицаДанных.ДатаПроведенияОценки		
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДанных.ISIN,
			|	_ТаблицаДанных.ДатаПроведенияОценки
			|;
			|		
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыISIN.Объект КАК ЦеннаяБумага,
			|	ИсточникиДанных.Объект КАК ИсточникДанных, 
			|	_ТаблицаДанных.ДатаПроведенияОценки КАК Период,
			|	_ТаблицаДанных.ISIN,
			|	_ТаблицаДанных.ASK,
			|	_ТаблицаДанных.BID,
			|	_ТаблицаДанных.LAST,
			|	Валюты.Ссылка КАК Валюта
			|ИЗ
			|	_ТаблицаДанных КАК _ТаблицаДанных
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыИзмененияКодаISIN КАК _ДатыИзмененияКодаISIN
			|		ПО _ДатыИзмененияКодаISIN.ISIN = _ТаблицаДанных.ISIN
			|			И _ДатыИзмененияКодаISIN.ДатаПроведенияОценки = _ТаблицаДанных.ДатаПроведенияОценки		
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыISIN
			|		ПО КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
			|			И КодыISIN.Код = _ТаблицаДанных.ISIN		
			|			И КодыISIN.Период = _ДатыИзмененияКодаISIN.ДатаИзменения		
			|			И 1 = 1		
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
			|			&Период,
			|			ВнешняяСистема = &ВнешняяСистема
			|				И ГруппаОбъектов = &ИдентификаторыИсточников
			|		) КАК ИсточникиДанных
			|		ПО ИсточникиДанных.Код = _ТаблицаДанных.ИдентификаторИсточника
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
			|		ПО Валюты.Наименование = _ТаблицаДанных.ИдентификаторВалюты	
			|");				   
		
		Запрос.УстановитьПараметр("ТаблицаДанных",				ЦеныRUData);
		Запрос.УстановитьПараметр("Период",						ЭтотОбъект.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ВнешняяСистема",				Справочники.ВнешниеСистемы.РуДата);
		Запрос.УстановитьПараметр("ИдентификаторыИсточников",	Справочники.ГруппыИмпортируемыхОбъектов.НайтиПоНаименованию("Идентификаторы площадок в базе Интерфакс"));
		
		// Отбор по ЦБ
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "КодыISIN.Объект = &ЦеннаяБумага");
			Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			
			Запись = РегистрыСведений.РасчетныеЦеныRUData.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ЭтотОбъект.ИмпортироватьТолькоОтсутствующиеКотировки Тогда
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЕсли;
			
			Попытка
				Запись.Записать();
			Исключение
				ЗарегистрироватьОшибку(ОписаниеОшибки());	
			КонецПопытки;
			
		КонецЦикла;		
		
		#КонецОбласти
		
	КонецЕсли;
	
	// Оповещаем пользователя
	
	ОповеститьОбОшибках(Механизм);

	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		
		Если ЦеныRUData = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для загрузки цен RU Data.");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка цен RU Data завершена.");
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ЗаполнитьПараметрыДляСбораСтатистикиИЗарегистрироватьНовуюСессию(Механизм)
	
	СтрСохраняемыеДанные = "Период,ЦеннаяБумага";
	ПараметрыОбработки = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ЭтотОбъект);
	
	Описание = "";
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОбработки[Реквизит];
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОбработки, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);	
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Возврат Сессия;
	
КонецФункции

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбОшибках(ИсточникПоУмолчанию)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки		= СтрСоединить(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС);
	ИсточникОшибки	= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник"), ЭтотОбъект.ДополнительныеСвойства.Источник, ИсточникПоУмолчанию);
		
	РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки, ИсточникОшибки);	
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	
КонецПроцедуры

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
